comp-sci/index.org
#+TITLE: Computer Science
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2020-12-12T13:15:00-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5 toc:nil num:nil
#+HTML_DOCTYPE: html5
# Created Saturday December 12, 2020 at  1:15PM
#+INCLUDE: ../org-macros.org
#+HTML_LINK_UP: ../index.html
#+HTML_LINK_HOME: ../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />

* Overview
:PROPERTIES:
:CUSTOM_ID: h-6a112c05-acf6-43ab-893b-e71f4fa415c3
:END:

Computer science has emerged into a sprawling field. Although I am
trying to focus on numerical analysis (to think further about
solving math and physics problems), the entire domain of
programming and computer science are rather fascinating.

Right now, I am working my way through the =scmutils= library used
in {{{book-title(The Structure and Interpretation of Classical Mechanics)}}}.
As I read through it, I'm thinking about how to implement the
algorithms in Common Lisp.

- [[file:apology.org][Apologia]] on various random conventional choices I've been forced
  to make
- [[file:numerical-analysis.org][Numerical Analysis]] ([[file:numerical-analysis/index.org][topics]]) for all my computational needs
- [[file:literate-programming.org][Literate Programming]] is one method to programming, as espoused by
  Donald Knuth
- [[file:theorem-provers.org][On Theorem Provers]] ([[file:theorem-provers/index.org][topics]])
- [[file:abstract-machines.org][Abstract Machines]] ([[file:abstract-machines/index.org][topics]]) as virtual machines for functional programming
  languages, began originally as pen-and-paper models of computer hardware
  + [[file:abstract-machines/secd.org][SECD Machine]] the primordial abstract machine which started it all
  + [[file:abstract-machines/cam.org][Categorical Abstract Machine]]
- [[file:lisp.org][Lisp]] ([[file:lisp/index.org][topics]]) the second-oldest language around, is my preferred language
  for programming most things
  + [[file:lisp/machine.org][Lisp Machine]] lore ([[file:lisp/machine/index.org][topics]]), partial history, sketchy and incomplete specifications
  + [[file:lisp/multiple-dispatch.org][Multiple Dispatch]] for multimethods, which can be implemented in
    various different ways
  + [[file:lisp/generic-arithmetic.org][Generic Arithmetic]] using multimethods for overloading operators
  + [[file:lisp/mal-2.org][Making a Lisp - Preliminaries]] with implementing the base types
- [[file:fortran.org][FORTRAN]] ([[file:fortran/index.org][topics]]) the language used for scientific computing and numerical analysis
- Functional languages
  - [[file:sml.org][Standard ML]] ([[file:sml/index.org][topics]]) the first "real" statically-typed functional programming language
  - [[file:haskell.org][Haskell]], the self-proclaimed purely functional programming language
- [[file:raspberry-pi.org][Raspberry Pi log]] - just documenting what I've done to my RPi
- [[file:./tex.org][TeX and LaTeX notes]]
