docs/comp-sci/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-04-09 Sat 11:07 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Computer Science</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Computer Science</h1>

<div id="outline-container-h-6a112c05-acf6-43ab-893b-e71f4fa415c3" class="outline-2">
<h2 id="h-6a112c05-acf6-43ab-893b-e71f4fa415c3">Overview</h2>
<div class="outline-text-2" id="text-h-6a112c05-acf6-43ab-893b-e71f4fa415c3">
<p>
Computer science has emerged into a sprawling field. Although I am
trying to focus on numerical analysis (to think further about
solving math and physics problems), the entire domain of
programming and computer science are rather fascinating.
</p>

<p>
Right now, I am working my way through the <code>scmutils</code> library used
in <cite class="book-title">The Structure and Interpretation of Classical Mechanics</cite>.
As I read through it, I'm thinking about how to implement the
algorithms in Common Lisp.
</p>

<ul class="org-ul">
<li><a href="apology.html">Apologia</a> on various random conventional choices I've been forced
to make</li>
<li><a href="numerical-analysis.html">Numerical Analysis</a> (<a href="numerical-analysis/index.html">topics</a>) for all my computational needs</li>
<li><a href="literate-programming.html">Literate Programming</a> is one method to programming, as espoused by
Donald Knuth</li>
<li><a href="lisp.html">Lisp</a> (<a href="lisp/index.html">topics</a>) the second-oldest language around, is my preferred language
for programming most things
<ul class="org-ul">
<li><a href="lisp/machine.html">Lisp Machine</a> lore (<a href="lisp/machine/index.html">topics</a>), partial history, sketchy and incomplete specifications</li>
<li><a href="lisp/multiple-dispatch.html">Multiple Dispatch</a> for multimethods, which can be implemented in
various different ways</li>
<li><a href="lisp/generic-arithmetic.html">Generic Arithmetic</a> using multimethods for overloading operators</li>
<li><a href="lisp/mal-2.html">Making a Lisp - Preliminaries</a> with implementing the base types</li>
</ul></li>
<li><a href="fortran.html">FORTRAN</a> (<a href="fortran/index.html">topics</a>) the language used for scientific computing and numerical analysis</li>
<li><a href="raspberry-pi.html">Raspberry Pi log</a> - just documenting what I've done to my RPi</li>
<li><a href="./tex.html">TeX and LaTeX notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-492fb6fe-e999-482c-9b70-2e473d0301e5" class="outline-2">
<h2 id="h-492fb6fe-e999-482c-9b70-2e473d0301e5">Theorem Provers</h2>
<div class="outline-text-2" id="text-h-492fb6fe-e999-482c-9b70-2e473d0301e5">
<p>
Theorem provers are a fascinating topic, which I love, so here's random
notes.
</p>

<ul class="org-ul">
<li><a href="abstract-machines.html">Abstract Machines</a> (<a href="abstract-machines/index.html">topics</a>) as virtual machines for functional programming
languages, began originally as pen-and-paper models of computer hardware
<ul class="org-ul">
<li><a href="abstract-machines/secd.html">SECD Machine</a> the primordial abstract machine which started it all</li>
<li><a href="abstract-machines/cam.html">Categorical Abstract Machine</a></li>
</ul></li>
<li>Functional languages
<ul class="org-ul">
<li><a href="sml.html">Standard ML</a> (<a href="sml/index.html">topics</a>) the first "real" statically-typed functional programming language</li>
<li><a href="haskell.html">Haskell</a>, the self-proclaimed purely functional programming language</li>
</ul></li>
<li><a href="theorem-provers.html">On Theorem Provers</a> (<a href="theorem-provers/index.html">topics</a>)
<ul class="org-ul">
<li><a href="theorem-provers/automath.html">Automath</a></li>
<li><a href="theorem-provers/mizar.html">Mizar</a> (<a href="theoremprovers/mizar/index.html">topics</a>)</li>
<li><a href="theorem-provers/hol-light.html">HOL Light</a> (<a href="theorem-provers/hol-light/index.html">topics</a>)</li>
<li><a href="theorem-provers/coq.html">Coq</a></li>
<li><a href="theorem-provers/isabelle.html">Isabelle</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2022-04-09 Sat 11:06.</p>
</div>
</body>
</html>